{
  "spec": {
    "title": "RFC 9112 - HTTP/1.1",
    "url": "https://httpwg.org/specs/rfc9112.html"
  },
  "algorithms": [
    {
      "html": "",
      "rationale": "if",
      "steps": [
        {
          "html": "<div><p>Any response to a HEAD request and any response with a <a href=\"https://httpwg.org/specs/rfc9110.html#status.1xx\" class=\"smpl\">1xx (Informational)</a>, <a href=\"https://httpwg.org/specs/rfc9110.html#status.204\" class=\"smpl\">204 (No Content)</a>, or <a href=\"https://httpwg.org/specs/rfc9110.html#status.304\" class=\"smpl\">304 (Not Modified)</a> status code is always terminated by the first empty line after the header fields, regardless of the header fields present in the message, and thus cannot contain a message body or trailer section.</p></div>"
        },
        {
          "html": "<div><p>Any <a href=\"https://httpwg.org/specs/rfc9110.html#status.2xx\" class=\"smpl\">2xx (Successful)</a> response to a CONNECT request implies that the connection will become a tunnel immediately after the empty line that concludes the header fields. A client <em class=\"bcp14\">MUST</em> ignore any <a href=\"https://httpwg.org/specs/rfc9112.html#body.content-length\" class=\"smpl\">Content-Length</a> or <a href=\"https://httpwg.org/specs/rfc9112.html#field.transfer-encoding\" class=\"smpl\">Transfer-Encoding</a> header fields received in such a message.</p></div>"
        },
        {
          "html": "<div><p>If a message is received with both a <a href=\"https://httpwg.org/specs/rfc9112.html#field.transfer-encoding\" class=\"smpl\">Transfer-Encoding</a> and a <a href=\"https://httpwg.org/specs/rfc9112.html#body.content-length\" class=\"smpl\">Content-Length</a> header field, the Transfer-Encoding overrides the Content-Length. Such a message might indicate an attempt to perform request smuggling (<a href=\"https://httpwg.org/specs/rfc9112.html#request.smuggling\" title=\"Request Smuggling\">Section 11.2</a>) or response splitting (<a href=\"https://httpwg.org/specs/rfc9112.html#response.splitting\" title=\"Response Splitting\">Section 11.1</a>) and ought to be handled as an error. An intermediary that chooses to forward the message <em class=\"bcp14\">MUST</em> first remove the received Content-Length field and process the Transfer-Encoding (as described below) prior to forwarding the message downstream.</p></div>"
        },
        {
          "html": "<div><p>If a <a href=\"https://httpwg.org/specs/rfc9112.html#field.transfer-encoding\" class=\"smpl\">Transfer-Encoding</a> header field is present and the chunked transfer coding (<a href=\"https://httpwg.org/specs/rfc9112.html#chunked.encoding\" title=\"Chunked Transfer Coding\">Section 7.1</a>) is the final encoding, the message body length is determined by reading and decoding the chunked data until the transfer coding indicates the data is complete.</p></div> <div><p>If a <a href=\"https://httpwg.org/specs/rfc9112.html#field.transfer-encoding\" class=\"smpl\">Transfer-Encoding</a> header field is present in a response and the chunked transfer coding is not the final encoding, the message body length is determined by reading the connection until it is closed by the server.</p></div> <div><p>If a <a href=\"https://httpwg.org/specs/rfc9112.html#field.transfer-encoding\" class=\"smpl\">Transfer-Encoding</a> header field is present in a request and the chunked transfer coding is not the final encoding, the message body length cannot be determined reliably; the server <em class=\"bcp14\">MUST</em> respond with the <a href=\"https://httpwg.org/specs/rfc9110.html#status.400\" class=\"smpl\">400 (Bad Request)</a> status code and then close the connection.</p></div>"
        },
        {
          "html": "<div><p>If a message is received without <a href=\"https://httpwg.org/specs/rfc9112.html#field.transfer-encoding\" class=\"smpl\">Transfer-Encoding</a> and with an invalid <a href=\"https://httpwg.org/specs/rfc9112.html#body.content-length\" class=\"smpl\">Content-Length</a> header field, then the message framing is invalid and the recipient <em class=\"bcp14\">MUST</em> treat it as an unrecoverable error, unless the field value can be successfully parsed as a comma-separated list (<a href=\"https://httpwg.org/specs/rfc9110.html#abnf.extension\" title=\"Lists (#rule ABNF Extension)\">Section 5.6.1</a> of <a href=\"https://httpwg.org/specs/rfc9112.html#HTTP\" id=\"rfc.xref.HTTP.39\"><cite title=\"HTTP Semantics\">[HTTP]</cite></a>), all values in the list are valid, and all values in the list are the same (in which case, the message is processed with that single value used as the Content-Length field value). If the unrecoverable error is in a request message, the server <em class=\"bcp14\">MUST</em> respond with a <a href=\"https://httpwg.org/specs/rfc9110.html#status.400\" class=\"smpl\">400 (Bad Request)</a> status code and then close the connection. If it is in a response message received by a proxy, the proxy <em class=\"bcp14\">MUST</em> close the connection to the server, discard the received response, and send a <a href=\"https://httpwg.org/specs/rfc9110.html#status.502\" class=\"smpl\">502 (Bad Gateway)</a> response to the client. If it is in a response message received by a user agent, the user agent <em class=\"bcp14\">MUST</em> close the connection to the server and discard the received response.</p></div>"
        },
        {
          "html": "<div><p>If a valid <a href=\"https://httpwg.org/specs/rfc9112.html#body.content-length\" class=\"smpl\">Content-Length</a> header field is present without <a href=\"https://httpwg.org/specs/rfc9112.html#field.transfer-encoding\" class=\"smpl\">Transfer-Encoding</a>, its decimal value defines the expected message body length in octets. If the sender closes the connection or the recipient times out before the indicated number of octets are received, the recipient <em class=\"bcp14\">MUST</em> consider the message to be incomplete and close the connection.</p></div>"
        },
        {
          "html": "<div><p>If this is a request message and none of the above are true, then the message body length is zero (no message body is present).</p></div>"
        },
        {
          "html": "<div><p>Otherwise, this is a response message without a declared message body length, so the message body length is determined by the number of octets received prior to the server closing the connection.</p></div>"
        }
      ]
    }
  ]
}